In [1]:
from typing import List
import pandas as pd
from sympy.stats.rv import sampling_E

### 1975. Maximum Matrix Sum
Your goal is to maximize the summation of the matrix's elements. Return the maximum sum of the matrix's elements using the operation mentioned above.

In [ ]:
class Solution:
    def maxMatrixSum(self, matrix: List[List[int]]) -> int:
        counter = 0
        min_negativ = float("inf")
        sum_of_elemetns = 0

        for i in matrix:
            for j in i:
                sum_of_elemetns += abs(j)
                if j <= 0:
                    counter += 1
                min_negativ = min(min_negativ, abs(j))

        return sum_of_elemetns if counter % 2 == 0 else sum_of_elemetns - 2 * min_negativ

### 619. Biggest Single Number

A single number is a number that appeared only once in the MyNumbers table.

Find the largest single number. If there is no single number, report null.

The result format is in the following example.

In [52]:
data = [[8], [8], [3], [3], [1], [4], [5], [6], [9]]
my_numbers = pd.DataFrame(data, columns=['num']).astype({'num':'Int64'})

df = my_numbers.groupby("num").size().reset_index(name = "count")
pd.DataFrame([df[df["count"] == 1].num.max()], columns=['num'])

# pd.DataFrame(my_numbers.value_counts().index[-1], columns=['num'])

   num
0    9

In [58]:
my_numbers.drop_duplicates(keep = False).max().to_frame("num")

     num
num    9

### 620. Not Boring Movies

Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".

Return the result table ordered by rating in descending order.

The result format is in the following example.

In [62]:
data = [[1, 'War', 'great 3D', 8.9], [2, 'Science', 'fiction', 8.5], [3, 'irish', 'boring', 6.2], [4, 'Ice song', 'Fantacy', 8.6], [5, 'House card', 'Interesting', 9.1]]
cinema = pd.DataFrame(data, columns=['id', 'movie', 'description', 'rating']).astype({'id':'Int64', 'movie':'object', 'description':'object', 'rating':'Float64'})

cinema[(cinema.id % 2 == 1) & (cinema.description != "boring")].sort_values(by = "rating", ascending=False)

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9

### 627. Swap Sex of Employees

Write a solution to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

The result format is in the following example.

In [93]:
data = [[1, 'A', 'm', 2500], [2, 'B', 'f', 1500], [3, 'C', 'm', 5500], [4, 'D', 'f', 500]]
salary = pd.DataFrame(data, columns=['id', 'name', 'sex', 'salary']).astype({'id':'Int64', 'name':'object', 'sex':'object', 'salary':'Int64'})


salary["sex"] = salary["sex"].map({"m": "f", "f": "m"})
salary
# salary["sex"] = salary.sex.apply(lambda s: "f" if s == "m" else "m")
# salary

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

### 1050. Actors and Directors Who Cooperated At Least Three Times

Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.

Return the result table in any order.

The result format is in the following example.

In [124]:
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

df = actor_director.groupby(['actor_id', 'director_id']).size().reset_index(name = "iteration")
df[df.iteration >= 3][["actor_id", "director_id"]]

   actor_id  director_id
0         1            1

### 1068. Product Sales Analysis I

(sale_id, year) is the primary key (combination of columns with unique values) of this table.
product_id is a foreign key (reference column) to Product table.
Each row of this table shows a sale on the product product_id in a certain year.
Note that the price is per unit.

In [145]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})

sales.merge(product, on="product_id", how="left")[["product_name", "year", "price"]]

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

### 1075. Project Employees I


Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

The query result format is in the following example.

In [173]:
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

df = project.merge(employee, on="employee_id", how="inner")[["project_id", "experience_years"]]
df.groupby("project_id", as_index=False).mean().round(2).rename(columns = {"experience_years": "average_years"})

   project_id  experience_years
0           1               2.0
1           2               2.5

### 1084. Sales Analysis III

Write a solution to report the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

In [214]:
data = [[1, 'S8', 1000], [2, 'G4', 800], [3, 'iPhone', 1400]]
product = pd.DataFrame(data, columns=['product_id', 'product_name', 'unit_price']).astype({'product_id':'Int64', 'product_name':'object', 'unit_price':'Int64'})
data = [[1, 1, 1, '2019-01-21', 2, 2000], [1, 2, 2, '2019-02-17', 1, 800], [2, 2, 3, '2019-06-02', 1, 800], [3, 3, 4, '2019-05-13', 2, 2800]]
sales = pd.DataFrame(data, columns=['seller_id', 'product_id', 'buyer_id', 'sale_date', 'quantity', 'price']).astype({'seller_id':'Int64', 'product_id':'Int64', 'buyer_id':'Int64', 'sale_date':'datetime64[ns]', 'quantity':'Int64', 'price':'Int64'})

product

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

In [175]:
sales

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800
2          2           2         3 2019-06-02         1    800
3          3           3         4 2019-05-13         2   2800

In [249]:
sale = sales[sales.product_id.isin(sales["product_id"].drop_duplicates(keep=False))]
sale = sale[(sale.sale_date < "2019-03-31") & ("2019-01-01" < sale.sale_date)][["product_id"]]
sale.merge(product)[["product_name"]]
# # sales[(sales.sale_date < "2019-03-31") & ("2019-01-01" < sales.sale_date)][["product_id", "product_name"]]

  product_name
0           S8